Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Timers and distribution summaries store at least three values internally:
ja_jp: タイマーとディストリビューションサマリーは、少なくとも 3 つの値を内部に保存します。

source: Timers are a specialized abstraction for measuring duration. Let's add a timer to measure how long it takes to determine if a number is prime.
ja_jp: タイマーは、期間を測定するための特殊な抽象化です。数値が素数かどうかを判断するのにかかる時間を測定するタイマーを追加しましょう。

source: Timers measure time, and will convert it into the units required by the monitoring backend
ja_jp: タイマーは時間を測定し、それをモニタリングバックエンドに必要な単位に変換します。

source: Timeslot
ja_jp: タイムスロット

source: Tips for writing native applications
ja_jp: ネイティブ・アプリケーションを作成するためのヒント

source: Title guidance for different Quarkus content types
ja_jp: Quarkus のさまざまなコンテンツタイプに対応したタイトルガイダンス

source: Titles and headings
ja_jp: タイトルと見出し

source: To <<jwt-parser,parse and verify JsonWebToken with JWTParser>>, use `smallrye-jwt` instead of `quarkus-smallrye-jwt` directly for the following situations:
ja_jp: <<jwt-parser,parse and verify JsonWebToken with JWTParser>> の場合、以下の状況では `quarkus-smallrye-jwt` の代わりに `smallrye-jwt` を直接使用してください。

source: To Quarkus...and beyond
ja_jp: Quarkusへ...そしてその先へ

source: To access the API server from within a Kubernetes cluster, some RBAC related resources are required (e.g. a ServiceAccount, a RoleBinding etc.). So, when the `kubernetes-client` extension is present, the `kubernetes` extension is going to create those resources automatically, so that application will be granted the `view` role. If more roles are required, they will have to be added manually.
ja_jp: Kubernetesクラスタ内からAPIサーバにアクセスするためには、RBAC関連のリソース(ServiceAccountやRoleBindingなど)が必要である。 そのため、 `kubernetes-client` エクステンションが存在する場合、 `kubernetes` エクステンションはこれらのリソースを自動的に作成し、アプリケーションに `view` ロールを付与します。 より多くのロールが必要な場合は、手動で追加しなければなりません。

source: To access the API server from within a Kubernetes cluster, some RBAC related resources are required (e.g. a ServiceAccount, a RoleBinding). So, when the `kubernetes-client` extension is present, the `kubernetes` extension is going to create those resources automatically, so that application will be granted the `view` role. If more roles are required, they will have to be added manually.
ja_jp: Kubernetes クラスター内から API サーバーにアクセスするには、いくつかの RBAC 関連のリソースが必要です (ServiceAccount、RoleBinding など)。そのため、 `kubernetes-client` エクステンションが存在する場合、 `kubernetes` エクステンションはそれらのリソースを自動的に作成するため、アプリケーションには `view` ロールが付与されます。さらにロールが必要な場合は、手動で追加する必要があります。

source: To access the API server from within a Kubernetes cluster, some RBAC related resources are required (e.g. a ServiceAccount, a RoleBinding). To ease the usage of the `kubernetes-client` extension, the `kubernetes` extension is going to generate a RoleBinding resource that binds a cluster role named "view" to the application ServiceAccount resource. It's important to note that the cluster role "view" won't be generated automatically, so it's expected that you have this cluster role with name "view" already installed in your cluster.
ja_jp: Kubernetesクラスタ内からAPIサーバにアクセスするには、いくつかのRBAC関連リソースが必要です（ServiceAccountやRoleBindingなど）。 `kubernetes-client` エクステンションの使い方を簡単にするために、 `kubernetes` エクステンションは、"view"という名前のクラスタロールをアプリケーションのServiceAccountリソースにバインドするRoleBindingリソースを生成します。クラスタロール"view"は自動生成されないので、クラスタに"view"という名前のクラスタロールがすでにインストールされていることが期待されます。

source: To access the APIs, you need to use the `@RedisClientName` qualifier:
ja_jp: API にアクセスするためには、 `@RedisClientName` 修飾子が必要です。

source: To access the Keycloak Administration Console, log in as the `admin` user. The username and password are both `admin`.
ja_jp: Keycloak管理コンソールにアクセスするには、 `admin` ユーザーでログインします。ユーザー名とパスワードはいずれも `admin` です。

source: To access the Keycloak Administration Console, log in as the `admin` user. Username should be `admin` and password `admin`.
ja_jp: Keycloak管理コンソールにアクセスするには、 `admin` ユーザーとしてログインしてください。ユーザー名は `admin` 、パスワードは `admin` とします。

source: To access the Keycloak Administration console, log in as the `admin` user by using the following login credentials:
ja_jp: Keycloak 管理コンソールにアクセスするには、次のログイン認証情報を使用して `admin` ユーザーとしてログインします。

source: To access the REST endpoint via curl, get the app URL from the heroku info command:
ja_jp: curl 経由で REST エンドポイントにアクセスするには、heroku info コマンドからアプリケーション URL を取得します。

source: To access the REST endpoint via curl, run:
ja_jp: curlでRESTエンドポイントにアクセスするには、次のように実行します。

source: To access the TLS configuration, inject the `TlsConfigurationRegistry` bean. You can retrieve a named TLS configuration by calling `get("<NAME>")` or the default configuration by calling `getDefault()`.
ja_jp: TLS 設定にアクセスするには、`TlsConfigurationRegistry` Bean を注入します。 `get("<NAME>")` を呼び出して名前付き TLS 設定を取得するか、`getDefault()` を呼び出してデフォルト設定を取得します。

source: To access the admin endpoint, get an access token for the `admin` user:
ja_jp: 管理エンドポイントにアクセスするには、 `admin` ユーザーのアクセストークンを取得します。

source: To access the admin endpoint, obtain a token for the `admin` user:
ja_jp: 管理エンドポイントにアクセスするには、 `admin` ユーザーのトークンを取得します。

source: To access the endpoint, you must obtain and include a valid JWT in your request. This involves two steps:
ja_jp: エンドポイントにアクセスするには、有効な JWT を取得してリクエストに含める必要があります。これには次の 2 つの手順が含まれます。

source: To access the example, either clone the Git repository or download an archive:
ja_jp: 例を利用するには、Git リポジトリーをクローンするか、アーカイブをダウンロードします。

source: To access the managed Vert.x instance, add the `quarkus-vertx` extension to your project. Note that this dependency may already be installed (as a transitive dependency).
ja_jp: マネージドVert.xインスタンスにアクセスするには、 `quarkus-vertx` エクステンションをプロジェクトに追加してください。この依存関係がすでにインストールされている可能性があることに注意してください（推移的依存関係として）。

source: To access the managed Vert.x instance, add the `quarkus-vertx` extension to your project. This dependency might already be available in your project (as a transitive dependency).
ja_jp: マネージド Vert.x インスタンスにアクセスするには、 `quarkus-vertx` エクステンションをプロジェクトに追加します。 この依存関係は、プロジェクトで既に利用可能な場合があります（推移的依存関係として）。

source: To achieve this you need to specify a compatible container type to receive all the data:
ja_jp: これを実現するには、すべてのデータを受信するための互換性のあるコンテナータイプを指定する必要があります。

source: To achieve this, you need to add the load-balancer implementation on your classpath:
ja_jp: これを実現するためには、クラスパスにロードバランサーの実装を追加する必要があります。

source: To achieve this, you need:
ja_jp: これを実現するには、以下を実行する必要があります。

source: To acquire the private user emails, `GitHubApiClient` REST Client is used:
ja_jp: プライベートなユーザーメールを取得するために、 `GitHubApiClient` REST クライアントが使用されます。

source: To activate the health check, set `quarkus.oidc-client.health.enabled` to true and ensure discovery is not disabled:
ja_jp: ヘルスチェックを有効にするには、`quarkus.oidc-client.health.enabled` を true に設定し、ディスカバリーが無効になっていないことを確認してください:

source: To add JFR support to your Quarkus executable, add the application property: `-Dquarkus.native.monitoring=jfr`. E.g.
ja_jp: Quarkus 実行可能ファイルに JFR サポートを追加するには、アプリケーションプロパティー `-Dquarkus.native.monitoring=jfr` を追加します。 たとえば

source: To add a key/value pair as an environment variable in the generated resources:
ja_jp: 生成されたリソースに環境変数としてキーとバリューのペアを追加する場合:

source: To add a label in the generated resources:
ja_jp: 生成されたリソースにラベルを追加するには次のようにします。

source: To add a link in the menu, you can use the `addPage` method, as all links go to a "page". `Page` has some builders to assist with building a page. The most common one is the `webComponentPageBuilder` - but we will discuss some others later.
ja_jp: メニューにリンクを追加するには、すべてのリンクが「ページ」に移動するため、`addPage` メソッドを使用できます。`Page` には、ページの構築を支援するいくつかのビルダーがあります。最も一般的なのは `webComponentPageBuilder` ですが、他のいくつかについては後で説明します。

source: To add a link on the card, you can use the `addPage` method, as all links go to a "page". `Page` has some builders to assist with building a page. The most common one is the `webComponentPageBuilder` - but we will discuss some others later.
ja_jp: カードにリンクを追加するには、すべてのリンクが「ページ」に移動するため、`addPage` メソッドを使用できます。`Page` には、ページの構築を支援するいくつかのビルダーがあります。最も一般的なのは `webComponentPageBuilder` ですが、他のいくつかについては後で説明します。

source: To add a link, you can use the `addPage` method, as all links go to a "page". `Page` has some builders to assist with building a page. For `external` links, use the `externalPageBuilder`.
ja_jp: リンクを追加するには `addPage` メソッドを使用します。すべてのリンクが "page" に移動します。 `Page` には、ページの構築を支援するビルダーがいくつかあります。 `external` リンクの場合は、 `externalPageBuilder` を使用します。

source: To add a nodeSelector in the generated `Deployment` (more information can be found in https://kubernetes.io/docs/tasks/configure-pod-container/assign-pods-nodes[Kubernetes documentation]), just apply the following configuration:
ja_jp: 以下の設定を適用するだけで、生成された `Deployment` に nodeSelector を追加できます (詳細は https://kubernetes.io/docs/tasks/configure-pod-container/assign-pods-nodes[Kubernetes ドキュメント] を参照)。

source: To add a page to the Dev UI menu, produce a `MenuPageBuildItem`:
ja_jp: Dev UI メニューにページを追加するには、`MenuPageBuildItem` を生成します。

source: To add a standalone assistant-powered page to the Dev UI, use the xref:dev-ui.adoc#card[`CardPageBuildItem`] and `Page.assistantPageBuilder()`:
ja_jp: Dev UI にスタンドアロンのアシスタント駆動ページを追加するには、 xref:dev-ui.adoc#card[`CardPageBuildItem`] と `Page.assistantPageBuilder()` を使用します。

source: To add a tab in the footer, you can use the `addPage` method, as all tabs renders a "page". `Page` has some builders to assist with building a page. The most common one is the `webComponentPageBuilder` - but we will discuss some others later.
ja_jp: フッターにタブを追加するには、すべてのタブが「ページ」をレンダリングするため、`addPage` メソッドを使用できます。`Page` には、ページの構築を支援するいくつかのビルダーがあります。最も一般的なのは `webComponentPageBuilder` ですが、他のいくつかについては後で説明します。

source: To add a tab in the setting dialog, you can use the `addPage` method.
ja_jp: 設定ダイアログにタブを追加するには、`addPage` メソッドを使用できます。

source: To add a tab to the Dev UI settings dialog, produce a `SettingPageBuildItem`:
ja_jp: Dev UI 設定ダイアログにタブを追加するには、`SettingPageBuildItem` を生成します。

source: To add additional custom labels, for example `foo=bar` just apply the following configuration:
ja_jp: 追加のカスタムラベルを追加するには、例えば `foo=bar` を設定する場合、以下の設定を適用するだけです。

source: To add all key/value pairs from `ConfigMap` as environment variables just apply the following configuration, separating each `ConfigMap` to be used as source by a comma (`,`):
ja_jp: `ConfigMap` からのすべてのキーと値のペアを環境変数として追加するには、以下の設定を適用し、ソースとして使用する各 `ConfigMap` をカンマ ( `,` ) で区切ってください。

source: To add all key/value pairs from `ConfigMap` as environment variables, apply the following configuration, separating each `ConfigMap` to be used as source by a comma (`,`):
ja_jp: `ConfigMap` のすべてのキー/値ペアを環境変数として追加するには、ソースとして使用する各 `ConfigMap` をカンマ ( `,` ) で区切って、以下の設定を適用します：

source: To add all key/value pairs of `Secret` as environment variables just apply the following configuration, separating each `Secret` to be used as source by a comma (`,`):
ja_jp: `Secret` のすべてのキーと値のペアを環境変数として追加するには、以下の設定を適用し、ソースとして使用する各 `Secret` をカンマ ( `,` ) で区切ってください。

source: To add all key/value pairs of `Secret` as environment variables, apply the following configuration, separating each `Secret` to be used as source by a comma (`,`):
ja_jp: `Secret` のすべてのキーと値のペアを環境変数として追加するには、ソースとして使用する各 `Secret` をカンマ ( `,` ) で区切って、以下の設定を適用します：

source: To add an annotation in the generated resources:
ja_jp: 生成されたリソースにアノテーションを追加するには次のようにします。

source: To add an unlisted page, you must return/produce a `UnlistedPageBuildItem`.
ja_jp: 未掲載ページを追加するには、`UnlistedPageBuildItem` を返す/生成する必要があります。

source: To add anything on the card, you must return/produce a `CardPageBuildItem`.
ja_jp: カードに何かを追加するには、 `CardPageBuildItem` を返す/生成する必要があります。

source: To add anything on the footer, you must return/produce a `FooterPageBuildItem`.
ja_jp: フッターに何かを追加するには、`FooterPageBuildItem` を返す/生成する必要があります。

source: To add anything on the menu, you must return/produce a `MenuPageBuildItem`.
ja_jp: メニューに何かを追加するには、`MenuPageBuildItem` を返す/生成する必要があります。

source: To add anything on the settings tab, you must return/produce a `SettingPageBuildItem`.
ja_jp: 設定タブに何かを追加するには、`SettingPageBuildItem` を返す/生成する必要があります。

source: To add data to the MDC and extract it in your log output:
ja_jp: MDCにデータを追加し、ログ出力に抽出するには以下のように行います：

source: To add entries to a Pod's `/etc/hosts` file (more information can be found in https://kubernetes.io/docs/concepts/services-networking/add-entries-to-pod-etc-hosts-with-host-aliases/[Kubernetes documentation]), just apply the following configuration:
ja_jp: Podの `/etc/hosts` ファイルにエントリを追加するには(詳細は https://kubernetes.io/docs/concepts/services-networking/add-entries-to-pod-etc-hosts-with-host-aliases/[Kubernetes のドキュメント] を参照)、以下の設定を適用するだけです。

source: To add full pages for your Dev UI extension such as this one:
ja_jp: 以下のようなDev UIエクステンションにフルページを追加するには

source: To add links to your extension's card, produce a `CardPageBuildItem` in a `@BuildStep`:
ja_jp: エクステンションのカードにリンクを追加するには、`@BuildStep` で `CardPageBuildItem` を生成します。

source: To add support for Prometheus metrics to your application, for example, use the `micrometer-registry-prometheus` extension. It will bring in the Quarkus Micrometer extension and Micrometer core libraries as dependencies.
ja_jp: 例えば、アプリケーションに Prometheus メトリクスのサポートを追加するには、 `micrometer-registry-prometheus` エクステンションを使用します。 これにより、Quarkus MicrometerエクステンションとMicrometerコアライブラリが依存ライブラリとして追加されます。

source: To add the Jakarta Persistence extension to an existing Maven project, complete one of the following steps:
ja_jp: 既存の Maven プロジェクトに Jakarta Persistence エクステンションを追加するには、次のいずれかの手順を実行します：

source: To add the OWASP Dependency check plugin to your Quarkus Maven project, add the following XML configuration to the `pom.xml` file:
ja_jp: Quarkus MavenプロジェクトにOWASP Dependency checkプラグインを追加するには、 `pom.xml` ファイルに次のXML設定を追加します：

source: To add the Open Worldwide Application Security Project (OWASP) Dependency-check-maven plugin to your Quarkus Maven project, add the following XML configuration to the `pom.xml` file:
ja_jp: Open Worldwide Application Security Project（OWASP）のDependency-check-mavenプラグインをQuarkus Mavenプロジェクトに追加するには、次のXML設定を `pom.xml` ファイルに追加します：

source: To add the Quarkus Security extension to an existing Maven project, run the following command from your project base directory:
ja_jp: 既存の Maven プロジェクトに Quarkus Security エクステンションを追加するには、プロジェクトのベースディレクトリーで次のコマンドを実行します:

source: To add the Security Jakarta Persistence extension to an existing Maven project with Hibernate ORM, run the following command from your project base directory:
ja_jp: Security Jakarta Persistence エクステンションを、Hibernate ORM を使用する既存の Maven プロジェクトに追加するには、プロジェクトのベース・ディレクトリーから以下のコマンドを実行します：

source: To add the Security Jakarta Persistence extension to an existing Maven project with Hibernate Reactive, run the following command from your project base directory:
ja_jp: Hibernate Reactive を使用する既存の Maven プロジェクトに Security Jakarta Persistence エクステンションを追加するには、プロジェクトのベース・ディレクトリーから以下のコマンドを実行します：

source: To add the `quarkus-openshift` extension to your project, use one of the following methods:
ja_jp: `quarkus-openshift` エクステンションをプロジェクトに追加するには、以下のいずれかの方法を使用します：

source: To add the `security-jpa` extension to an existing Maven project, run the following command from your project base directory:
ja_jp: 既存の Maven プロジェクトに `security-jpa` エクステンションを追加するには、プロジェクトのベースディレクトリで次のコマンドを実行します:

source: To add the extensions to an existing project, follow the instructions below.
ja_jp: 既存のプロジェクトにエクステンションを追加する場合は、以下の手順で行ってください。

source: To add the persistence libraries, run
ja_jp: 永続化ライブラリーを追加するには、以下を実行してください。

source: To address these complexities, developers must ensure that their AI-powered applications are both robust and secure. This includes implementing mechanisms to handle unpredictable behavior, validating and sanitizing inputs, monitoring outputs for potential issues, and auditing AI interactions for compliance and transparency.
ja_jp: これらの複雑さに対処するために、開発者は AI を活用したアプリケーションが堅牢かつ安全であることを保証する必要があります。これには、予測できない動作を処理するメカニズムの実装、入力の検証とサニタイズ、潜在的な問題の出力の監視、コンプライアンスと透明性のための AI のやり取りの監査が含まれます。

source: To address these issues, we have created https://smallrye.io/smallrye-stork[SmallRye Stork]. Stork provides both features:
ja_jp: これらの問題を解決するために、私たちは link:https://smallrye.io/smallrye-stork[SmallRye Stork]を作りました。Storkは両方の機能を備えています。

source: To address this, you can configure Hibernate Search to not send any request on startup:
ja_jp: これに対処するためには起動時にリクエストを送信しないようにHibernate Searchを設定します:

source: To address this, you can take advantage of validation groups. Validation groups are markers that you put on your constraints in order to enable or disable them at will.
ja_jp: これに対処するために、バリデーション・グループを利用することができます。バリデーション・グループは、制約を有効または無効にするために制約に付けるマーカーです。

source: To adjust runtime logging, modify the `application.properties` file.
ja_jp: ランタイムロギングを調整するには、 `application.properties` ファイルを編集します。

source: To alleviate this restriction, the `@QuarkusTest` annotation defines a JUnit 5 `@Tag`: `io.quarkus.test.junit.QuarkusTest`. You can use this tag to isolate the `@QuarkusTest` test in a specific execution run, for example with the Maven Surefire Plugin:
ja_jp: この制限を緩和するために、 `@QuarkusTest` アノテーションは JUnit5 `@Tag` を定義します: `io.quarkus.test.junit.QuarkusTest` 。このタグを使用して、特定の実行 で `@QuarkusTest` テストを分離できます。以下は Maven Surefire プラグインを使用した例です。

source: To alleviate this restriction, the `@QuarkusTest` annotation defines a JUnit `@Tag`: `io.quarkus.test.junit.QuarkusTest`. You can use this tag to isolate the `@QuarkusTest` test in a specific execution run, for example with the Maven Surefire Plugin:
ja_jp: この制限を緩和するために、 `@QuarkusTest` アノテーションは JUnit `@Tag`: `io.quarkus.test.junit.QuarkusTest` を定義します。このタグを使用して、特定の実行で `@QuarkusTest` テストを分離できます。以下は Maven Surefire プラグインを使用した例です:

source: To allow access to a public resource without applying `quarkus-keycloak-authorization` policies, define a `permit` HTTP policy in the `application.properties` file. For more information, see the xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints] guide.
ja_jp: `quarkus-keycloak-authorization` ポリシーを適用せずにパブリックリソースへのアクセスを許可するには、 `application.properties` ファイルで `permit` HTTP ポリシーを定義します。 詳細は、xref:security-authorize-web-endpoints-reference.adoc[Web エンドポイントの認可] ガイドを参照してください。

source: To allow applications to connect, the extension should override the default configuration for the service with the mapped ports. This must be done after starting the container. For example,
ja_jp: アプリケーションが接続できるようにするには、エクステンションはマッピングされたポートを使用してサービスのデフォルト設定をオーバーライドする必要があります。 これはコンテナーを起動した後に実行する必要があります。 以下に例を示します。

source: To allow using multiple JDBC datasources in the same transaction:
ja_jp: 同じトランザクションで複数の JDBC データソースを使用できるようにするには、次の手順を実行します。

source: To allow your Quarkus application to use that secret, add the following line to the `application.properties` file:
ja_jp: Quarkus アプリケーションがそのシークレットを使用できるようにするには、 `application.properties` ファイルに以下の行を追加します。

source: To apply an interceptor to all exposed services, annotate it with `@io.quarkus.grpc.GlobalInterceptor`. To apply an interceptor to a single service, register it on the service with `@io.quarkus.grpc.RegisterInterceptor`:
ja_jp: 公開されているすべてのサービスにインターセプターを適用するには、 `@io.quarkus.grpc.GlobalInterceptor` でアノテーションを付けます。インターセプターを単一のサービスに適用するには、 `@io.quarkus.grpc.RegisterInterceptor` でそのサービスに登録します。

source: To apply encryption, add the `quarkus.http.auth.session.encryption-key` property, and ensure the value you set is at least 16 characters long. The encryption key is hashed by using SHA-256. The resulting digest is used as a key for AES-256 encryption of the cookie value. The cookie contains an expiry time as part of the encrypted value, so all nodes in the cluster must have their clocks synchronized. At one-minute intervals, a new cookie gets generated with an updated expiry time if the session is in use.
ja_jp: 暗号化を適用するには、 `quarkus.http.auth.session.encryption-key` プロパティーを追加し、設定する値が 16 文字以上であるようにして下さい。 暗号化キーは SHA-256 を使用してハッシュ化されます。 結果のダイジェストは、Cookie 値の AES-256 暗号化のキーとして使用されます。 Cookie には暗号化された値の一部として有効期限が含まれているため、クラスター内のすべてのノードのクロックが同期されている必要があります。 セッションが使用中であれば、1 分間隔で有効期限が更新された新しい Cookie が生成されます。

source: To authenticate and authorize a tenant by using the OIDC authorization code flow, read the xref:security-oidc-code-flow-authentication.adoc[OpenID Connect authorization code flow mechanism for protecting web applications] guide.
ja_jp: OIDC 認可コードフローを使用してテナントを認証および認可するには、xref:security-oidc-code-flow-authentication.adoc[Web アプリケーションを保護するための OpenID Connect 認可コードフローメカニズム] ガイドを参照してください。

source: To authenticate to the application, enter the following credentials at the Keycloak login page:
ja_jp: アプリケーションを認証するには、Keycloakログインページで以下のクレデンシャルを入力してください：

source: To authenticate to the application, enter the following credentials in the Keycloak login page:
ja_jp: アプリケーションを認証するには、Keycloak ログインページで次の認証情報を入力します。

source: To author the DMN model yourself, just follow these steps:
ja_jp: DMNモデルを自分で作成するには、以下の手順を実施下さい。

source: To authorize a tenant by using Bearer Token Authorization, see the xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) Bearer token authentication] guide.
ja_jp: Bearer Token Authorization を使用してテナントを認可するには、xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) ベアラートークン認証] ガイドを参照してください。

source: To avoid any modeler installation you can use directly use https://bpmn.new[BPMN.new] to design and model your process through your favorite web browser.
ja_jp: モデラーのインストールを避けるために、 link:https://bpmn.new[BPMN.new] を直接使用して、お気に入りのWebブラウザを使ってプロセスの設計とモデリングを行うことができます。

source: To avoid any modeler installation you can use directly use https://dmn.new[DMN.new] to author your DMN model through your favorite web browser.
ja_jp: モデラーのインストールをしなくても、お気に入りのWebブラウザからlink:https://sandbox.kie.org/#/[KIE Sandbox]を直接使ってDMNモデルをオーサリングすることができます。

source: To avoid conflicts with your application endpoints, they have all been moved to the `/q/` namespace. Redirects have been added to redirect the old URLs to the new ones.
ja_jp: アプリケーションのエンドポイントとの衝突を避けるために、これらはすべて `/q/` 名前空間に移動されました。古い URL を新しい URL にリダイレクトするためのリダイレクトが追加されました。

source: To avoid naming conflicts between different types of services, prefix the `service key` with a specific datasource type, such as `postgresql-__<person>__`.
ja_jp: 異なるタイプのサービス間での名前の競合を避けるために、`service key` の前に `postgresql-__<person>__` のような特定のデータソースのタイプを付けます。

source: To avoid this issue, use a development CA to sign certificates and install the CA in the system truststore. This ensures that the system trusts all certificates signed by the CA. Quarkus simplifies the generation of a development CA and the certificates it signs.
ja_jp: この問題を回避するには、開発用 CA を使用して証明書に署名し、その CA をシステムトラストストアにインストールします。これにより、システムは CA によって署名されたすべての証明書を信頼するようになります。Quarkus は、開発用 CA とそれが署名する証明書の生成を簡素化します。

source: To avoid this issue, use a development CA to sign certificates and install the CA in the system truststore. This ensures that the system trusts all certificates signed by the CA. Quarkus simplifies the generation of a development CA and the certificates that are signed by this CA.
ja_jp: この問題を回避するには、開発 CA を使用して証明書に署名し、その CA をシステムトラストストアにインストールします。 これにより、システムは CA によって署名されたすべての証明書を信頼するようになります。 Quarkus は、開発 CA とこの CA によって署名される証明書の生成を簡素化します。

source: To avoid this issue, you can use a development CA to sign certificates and install the CA in the system truststore. This ensures that the system trusts all certificates signed by the CA.
ja_jp: この問題を回避するには、開発用 CA を使用して証明書に署名し、その CA をシステムのトラストストアにインストールします。 これにより、システムが CA によって署名されたすべての証明書を信頼するようになります。

source: To be able to deploy your application to Azure, log in to Azure:
ja_jp: アプリケーションを Azure にデプロイするには、Azure にログインしてください:
